tutorials/ocmfMassTransferDns/Lactose_nG153_C1_P30_J60_Lx5_Ly1_Lz25/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /    A nd          | Version:  v2506                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./constant/simulationConditions"

ddtSchemes
{
    default         CrankNicolson 1.0;                // 2ª ordem no tempo
}

gradSchemes
{
    default         Gauss linear;            // malha com baixa não-ortogonalidade
}

divSchemes
{
    default                             none;

    // Momentum: 2ª ordem upwind consistente e robusto
    div(phi,U)      Gauss linear;
    // (Opcional se testares Co baixo):  div(phi,U) Gauss QUICKV 1;

    // Escalar CA: TVD bounded para evitar overshoots/negativos
    div(phi,CA) bounded Gauss limitedLinear 1;
    div(phi,CT) bounded Gauss limitedLinear 1;
    // Termo viscoso
    div((nuEff*dev2(T(grad(U)))))  Gauss linear;
}

laplacianSchemes
{
    // Com max non-orth ~21°, 'corrected' é adequado e preciso
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;               // consistente com laplacian 'corrected'
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
