tutorials/ocmfMassTransferDns/Lactose_nG153_C1_P30_J60_Lx5_Ly1_Lz25/system/surfacePatchDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	surfacePatchDict;
}
geometry
{
	model.stl
	{
		type	triSurfaceMesh;
	}
}
surfaces
{
	model.stl
	{
		type	autoPatch;
		featureAngle	60;
	}
}
